aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx72t/r_s12ad_rx72t.c
volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg2_ptrs[ADC_REG_MAX+1] =
                    {   &S12AD2.ADDR0,       /* channel 0 */
                        &S12AD2.ADDR1,       /* channel 1 */
                        &S12AD2.ADDR2,       /* channel 2 */
                        &S12AD2.ADDR3,       /* channel 3 */
                        &S12AD2.ADDR4,       /* channel 4 */
                        &S12AD2.ADDR5,       /* channel 5 */
                        &S12AD2.ADDR6,       /* channel 6 */
                        &S12AD2.ADDR7,       /* channel 7 */
                        &S12AD2.ADDR8,       /* channel 8 */
                        &S12AD2.ADDR9,       /* channel 9 */
                        &S12AD2.ADDR10,      /* channel 10 */
                        &S12AD2.ADDR11,      /* channel 11 */
                        &S12AD2.ADDR16,      /* channel 16 */
                        &S12AD2.ADDR17,      /* channel 17 */
                        &S12AD2.ADTSDR,      /* temperature sensor */
                        &S12AD2.ADOCDR,      /* voltage sensor */
                        &S12AD2.ADDBLDR,     /* double trigger register */
                        &S12AD2.ADDBLDRA,    /* double trigger registerA */
                        &S12AD2.ADDBLDRB,    /* double trigger registerB */
                        &S12AD2.ADRD.WORD    /* self-diagnosis register */
                    };


/* In ROM. Sample State (SST) Register pointers */

/* 8-bit register pointers */
/* 8-bit register pointers */
volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg0_ptrs[ADC_SST_REG_MAX+1] =
                    {   &S12AD.ADSSTR0,      /* channel 0 */
                        &S12AD.ADSSTR1,      /* channel 1 */
                        &S12AD.ADSSTR2,      /* channel 2 */
                        &S12AD.ADSSTR3,      /* channel 3 */
                        &S12AD.ADSSTR4,      /* channel 4 */
                        &S12AD.ADSSTR5,      /* channel 5 */
                        &S12AD.ADSSTR6,      /* channel 6 */
                        &S12AD.ADSSTR7,      /* channel 7 */
                        NULL,                /* channel 8 */
                        NULL,                /* channel 9 */
                        NULL,                /* channel 10 */
                        NULL,                /* channel 11 */
                        NULL,                /* channel 16, 17 */
                        NULL,                /* temperature sensor */
                        NULL                 /* voltage sensor */
                    };


volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg1_ptrs[ADC_SST_REG_MAX+1] =
                    {   &S12AD1.ADSSTR0,     /* channel 0 */
                        &S12AD1.ADSSTR1,     /* channel 1 */
                        &S12AD1.ADSSTR2,     /* channel 2 */
                        &S12AD1.ADSSTR3,     /* channel 3 */
                        &S12AD1.ADSSTR4,     /* channel 4 */
                        &S12AD1.ADSSTR5,     /* channel 5 */
                        &S12AD1.ADSSTR6,     /* channel 6 */
                        &S12AD1.ADSSTR7,     /* channel 7 */
                        NULL,                /* channel 8 */
                        NULL,                /* channel 9 */
                        NULL,                /* channel 10 */
                        NULL,                /* channel 11 */
                        NULL,                /* channel 16, 17 */
                        NULL,                /* temperature sensor */
                        NULL                 /* voltage sensor */
                    };

volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg2_ptrs[ADC_SST_REG_MAX+1] =
                    {   &S12AD2.ADSSTR0,     /* channel 0 */
                        &S12AD2.ADSSTR1,     /* channel 1 */
                        &S12AD2.ADSSTR2,     /* channel 2 */
                        &S12AD2.ADSSTR3,     /* channel 3 */
                        &S12AD2.ADSSTR4,     /* channel 4 */
                        &S12AD2.ADSSTR5,     /* channel 5 */
                        &S12AD2.ADSSTR6,     /* channel 6 */
                        &S12AD2.ADSSTR7,     /* channel 7 */
                        &S12AD2.ADSSTR8,     /* channel 8 */
                        &S12AD2.ADSSTR9,     /* channel 9 */
                        &S12AD2.ADSSTR10,    /* channel 10 */
                        &S12AD2.ADSSTR11,    /* channel 11 */
                        &S12AD2.ADSSTRL,     /* channel 16, 17 */
                        &S12AD2.ADSSTRT,     /* temperature sensor */
                        &S12AD2.ADSSTRO      /* voltage sensor */
                    };


#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_open_cfg(uint8_t                unit,
                                    adc_mode_t const       mode,
                                    adc_cfg_t * const      p_cfg,
                                    void         (* const  p_callback)(void *p_args));

static adc_err_t adc_check_scan_config(uint8_t const unit,  adc_ch_cfg_t *p_config);
#endif

static adc_err_t adc_configure_scan(uint8_t const unit,  adc_ch_cfg_t *p_config);
static void adc_configure_sensors(adc_ch_cfg_t  *p_config);
static void adc_enable_s12adi(uint8_t unit);
static void adc_enable_s12gbadi(uint8_t unit);
static void adc_enable_s12gcadi(uint8_t unit);
static void adc_s12cmpia0_isr(void *cb_args);
static void adc_s12cmpib0_isr(void *cb_args);
static void adc_s12cmpia1_isr(void *cb_args);
static void adc_s12cmpib1_isr(void *cb_args);
static void adc_s12cmpia2_isr(void *cb_args);
static void adc_s12cmpib2_isr(void *cb_args);
static adc_err_t adc_en_comparator_level0(uint8_t unit, adc_cmpwin_t  *p_cmpwin);
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit);
static uint32_t adc_get_and_clr_cmpi_flagsb(uint8_t unit);

R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12AD,S12ADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12AD1,S12ADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi2_isr, VECT(S12AD2,S12ADI2))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12AD,S12GBADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12AD1,S12GBADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi2_isr, VECT(S12AD2,S12GBADI2))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi0_isr, VECT(S12AD,S12GCADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi1_isr, VECT(S12AD1,S12GCADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi2_isr, VECT(S12AD2,S12GCADI2))

