aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx72t/r_s12ad_rx72t.c
        tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);

        if (tmp_mask != tmp_adansa)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* Should be set ADC_MASK_CONV_ORDER_OFF to not used ADSCSn register. */
        bit_cnt = 0;

        /* WAIT_LOOP */
        for (i= 0x00000001; i<0x00040000; i<<=1)
        {
            if (0 != (tmp_mask & i))
            {
                bit_cnt++;
            }
        }

        /* WAIT_LOOP */
        for (i=bit_cnt; i<ADC_2_REG_ARRAY_MAX; i++)
        {
            if (ADC_MASK_CONV_ORDER_OFF != p_config->conversion_order[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

        /* Should be set the channels which use the channel-dedicated sample-and-hold circuit to 
           ADSCS0/1/2 registers. */
        if ((1 == unit) || (0 == unit))
        {
            if (0x01 == (p_config->sample_hold_mask & 0x01))
            {
                if ((ADC_MASK_CH0 != p_config->conversion_order[0])
                && (ADC_MASK_CH0 != p_config->conversion_order[1])
                && (ADC_MASK_CH0 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (0x02 == (p_config->sample_hold_mask & 0x02))
            {
                if ((ADC_MASK_CH1 != p_config->conversion_order[0])
                && (ADC_MASK_CH1 != p_config->conversion_order[1])
                && (ADC_MASK_CH1 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (0x04 == (p_config->sample_hold_mask & 0x04))
            {
                if ((ADC_MASK_CH2 != p_config->conversion_order[0])
                && (ADC_MASK_CH2 != p_config->conversion_order[1])
                && (ADC_MASK_CH2 != p_config->conversion_order[2]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
    }

    /* Parameter check of the programmable gain amplifier */
    if ((1 == unit) || (0 == unit))
    {

        /* Enumeration constant must be used for the parameter setting. */
        /* WAIT_LOOP */
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            if (ADC_PATH_MAX <= p_config->signal_path_control[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

        if ((0xB == BSP_CFG_MCU_PART_FUNCTION) || (0xF == BSP_CFG_MCU_PART_FUNCTION))
        {

            /* Should not be enable PGA differential input for the package of without PGA differential input. */
            /* WAIT_LOOP */
            for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
            {
                if ((ADC_PGA_DIFFERENTIAL_INPUT_1 == p_config->signal_path_control[i])
                || (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[i])
                || (ADC_PGA_DIFFERENTIAL_INPUT_3 == p_config->signal_path_control[i]))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
        else
        {

            /* When a differential input is enabled and input the signal of the ANx pin to the ADC, 
               should be use the channel-dedicated sample-and-hold circuits. */
            if (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[0])
            {
                if (0x01 != (p_config->sample_hold_mask & 0x01))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[1])
            {
                if (0x02 != (p_config->sample_hold_mask & 0x02))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (ADC_PGA_DIFFERENTIAL_INPUT_2 == p_config->signal_path_control[2])
            {
                if (0x04 != (p_config->sample_hold_mask & 0x04))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }

            if (0 == unit)
            {
                tmp_macro[0] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN000;
                tmp_macro[1] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN001;
                tmp_macro[2] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN002;
                tmp_macro[3] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_PGAVSS0;
            }
            else if (1 == unit)
            {
                tmp_macro[0] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN100;
                tmp_macro[1] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN101;
                tmp_macro[2] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_AN102;
                tmp_macro[3] = BSP_CFG_AD_NEGATIVE_VOLTAGE_INPUT_PGAVSS1;
            }

            /* When a differential input is enabled and input the signal of the ANx pin to the ADC, 
               negative voltage should not be input to ANx pin. */
            /* The ANx pin to input the negative voltage must be set to the differential input. */
            /* WAIT_LOOP */
            for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
            {
                if (1 == tmp_macro[i])
                {
                    if ((ADC_PGA_DIFFERENTIAL_INPUT_1 != p_config->signal_path_control[i])
                    && (ADC_PGA_DIFFERENTIAL_INPUT_3 != p_config->signal_path_control[i]))
                    {
                        return ADC_ERR_ILLEGAL_ARG;
                    }
                }
            }

            /* When inputting a negative voltage to the PGAVSSx pin, 
               all pins in the same unit must be set to differential input. */
            if (1 == tmp_macro[3])
            {

                /* WAIT_LOOP */
                for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
                {
                    if ((ADC_PGA_DIFFERENTIAL_INPUT_1 != p_config->signal_path_control[i])
                    && (ADC_PGA_DIFFERENTIAL_INPUT_2 != p_config->signal_path_control[i])
                    && (ADC_PGA_DIFFERENTIAL_INPUT_3 != p_config->signal_path_control[i]))
                    {
                        return ADC_ERR_ILLEGAL_ARG;
                    }
                }
            }
        }

