aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx72t/r_s12ad_rx72t.c
    if ((NULL != g_dcb[0].p_callback) && (FIT_NO_FUNC != g_dcb[0].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_METB;
        args.unit = 0;
        args.compare_flagsb = adc_get_and_clr_cmpi_flagsb(0);
        g_dcb[0].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flagsb(0);
    }
} /* End of function adc_s12cmpib0_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpia1_isr
* Description  : Unit1 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpia1_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[1].p_callback) && (FIT_NO_FUNC != g_dcb[1].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.unit = 1;
        args.compare_flags = adc_get_and_clr_cmpi_flags(1);
        g_dcb[1].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flags(1);
    }
} /* End of function adc_s12cmpia1_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpib1_isr
* Description  : Unit1 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpib1_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[1].p_callback) && (FIT_NO_FUNC != g_dcb[1].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_METB;
        args.unit = 1;
        args.compare_flagsb = adc_get_and_clr_cmpi_flagsb(1);
        g_dcb[1].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flagsb(1);
    }
} /* End of function adc_s12cmpib1_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpia2_isr
* Description  : Unit2 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpia2_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[2].p_callback) && (FIT_NO_FUNC != g_dcb[2].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.unit = 2;
        args.compare_flags = adc_get_and_clr_cmpi_flags(2);
        g_dcb[2].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flags(2);
    }
} /* End of function adc_s12cmpia2_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpib2_isr
* Description  : Unit1 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpib2_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[2].p_callback) && (FIT_NO_FUNC != g_dcb[2].p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_METB;
        args.unit = 2;
        args.compare_flagsb = adc_get_and_clr_cmpi_flagsb(2);
        g_dcb[2].p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flagsb(2);
    }
} /* End of function adc_s12cmpib2_isr() */


/*****************************************************************************
* Function Name: adc_s12adi0_isr
* Description  : Unit0 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[0].p_callback) && (FIT_NO_FUNC != g_dcb[0].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 0;
        g_dcb[0].p_callback(&args);
    }
} /* End of function adc_s12adi0_isr() */


/*****************************************************************************
* Function Name: adc_s12adi1_isr
* Description  : Unit1 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi1_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[1].p_callback) && (FIT_NO_FUNC != g_dcb[1].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 1;
        g_dcb[1].p_callback(&args);
    }
} /* End of function adc_s12adi1_isr() */


/*****************************************************************************
* Function Name: adc_s12adi2_isr
* Description  : Unit2 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi2_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb[2].p_callback) && (FIT_NO_FUNC != g_dcb[2].p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        args.unit = 2;
        g_dcb[2].p_callback(&args);
    }
} /* End of function adc_s12adi2_isr() */


/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12gbadi0_isr(void)
{
    adc_cb_args_t   args;

